
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Angular kicks in · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="component.html" />
    
    
    <link rel="prev" href="installations.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Acerca de
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    Introdicción
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="installations.html">
            
                <a href="installations.html">
            
                    
                    Instalaciones
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="angular_kicks_in.html">
            
                <a href="angular_kicks_in.html">
            
                    
                    Angular kicks in
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="component.html">
            
                <a href="component.html">
            
                    
                    Componentes
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="a_new_component.html">
            
                <a href="a_new_component.html">
            
                    
                    Un nuevo componente
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="class.html">
            
                <a href="class.html">
            
                    
                    Clases
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="property_binding.html">
            
                <a href="property_binding.html">
            
                    
                    Enlace de Propiedades
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="event_binding.html">
            
                <a href="event_binding.html">
            
                    
                    Enlace de Eventos
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="element_ref_-.html">
            
                <a href="element_ref_-.html">
            
                    
                    Elemento ref - #
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="the_list.html">
            
                <a href="the_list.html">
            
                    
                    La lista
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="new_component_todo-item.html">
            
                <a href="new_component_todo-item.html">
            
                    
                    Nuevo componente todo-item
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="add_items.html">
            
                <a href="add_items.html">
            
                    
                    Agregar elementos
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="refactor_app_component.html">
            
                <a href="refactor_app_component.html">
            
                    
                    Reconstruir app component
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="adding_style.html">
            
                <a href="adding_style.html">
            
                    
                    Agregar estilos
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="service.html">
            
                <a href="service.html">
            
                    
                    Servicios
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="add_more_abilities_to_service.html">
            
                <a href="add_more_abilities_to_service.html">
            
                    
                    Agrega mas características al servicio
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="local_storage.html">
            
                <a href="local_storage.html">
            
                    
                    Almacenamiento local
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="remove_item.html">
            
                <a href="remove_item.html">
            
                    
                    Eliminar elemento
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="adding_a_checkbox.html">
            
                <a href="adding_a_checkbox.html">
            
                    
                    Agregar un checkbox
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="deploy_to_githubpages.html">
            
                <a href="deploy_to_githubpages.html">
            
                    
                    Desplegar a GithubPages
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="enrich_the_todo-item_component.html">
            
                <a href="enrich_the_todo-item_component.html">
            
                    
                    Enriquecer el componente todo-item
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="generating_a_new_project.html">
            
                <a href="generating_a_new_project.html">
            
                    
                    Apéndice 1: Generando un nuevo proyecto
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="appendix-2-tutorial-extensions.html">
            
                <a href="appendix-2-tutorial-extensions.html">
            
                    
                    Apéndice 2: Extensiones del tutoral
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Angular kicks in</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="angular-kicks-in">Angular kicks in</h1>
<p>D&#xE9;mole una mirada al proyecto y c&#xF3;mo angular aparece en la imagen. Todos los archivos relevantes en esta etapa existen dentro de la carpeta <code>src</code>.</p>
<p>Lee mas sobre los archivos autogenerados por Angular CLI en el <a href="generating_a_new_project.html">Ap&#xE9;ndice 1: Generando un nuevo proyecto</a>.</p>
<p>Abre el archivo <code>index.html</code>. El contenido que es renderizado en la ventana del navegador tiene todo lo que ves dentro del elemento <code>&lt;body&gt;</code>. Todo lo que puedes ver ahora es otro elemento no HTML: <code>&lt;todo-root&gt;</code>. Este elemento es actualmente un componente de Angular, definido en el archivo <code>app/app.component.ts</code> con la clase llamada <strong>AppComponent</strong>. (Vamos a revisar esto en el siguiente cap&#xED;tulo).</p>
<p><strong>Nota:</strong> Si tu creaste este proyecto sin la bandera <code>--prefix todo</code> o <code>-p todo</code> entonces el elemento que ver&#xE1;s ser&#xE1; <code>&lt;app-root&gt;</code>. <code>app</code> es el prefijo por defecto para los componentes selectores del proyecto. Puedes cambiar la configuraci&#xF3;n en el archivo <code>angular-cli.json</code>.</p>
<blockquote>
<p>Angular puede ser definido de muchas maneras. Una de ellas es c&#xF3;digo Javascript que se ejecuta cuando la aplicaci&#xF3;n es presentada en el navegador. Todo el c&#xF3;digo que tu escribas, componentes, m&#xF3;dulos, servicios, etc. ser&#xE1;n reconocidos por Angular. Angular ejecutar&#xE1; acciones acordemente. Por ejemplo, los componentes que tu escribas ser&#xE1;n compilados en funciones de Javascript. Estas funciones insertan el contenido del componente en el DOM - Document Object Model el cual usa el navegador para mostrar la aplicaci&#xF3;n. Esto es como veras el componente que creaste en pantalla.</p>
</blockquote>
<p>Entonces <code>&lt;todo-root&gt;</code> no es un elemento HTML, es un Componente de Angular. Cuando la aplicaci&#xF3;n est&#xE1; lista, el contenido del componente es insertadno en el lugar de la etiqueta <code>&lt;todo-root&gt;</code>.</p>
<p>Dentro de la etiqueta <code>&lt;todo-root&gt;</code> ver&#xE1;s el texto &quot;Loading...&quot;. todo lo que est&#xE1; dentro de la etiqueta ser&#xE1; renderizado por el navegador despu&#xE9;s que Angular compile la aplicaci&#xF3;n. Cuando Angular termina, ya no ver&#xE1;s &quot;Loading...&quot; en la pantalla. En lugar de esto, ver&#xE1;s el componente <code>&lt;todo-root&gt;</code> y su contenido, el cual es &quot;**todo works&quot;.</p>
<p>Angular necesita que nosotros definamos cuando queremos que compile. Para esto definimos m&#xF3;dulos de Angular, o <strong>ngModules</strong>, los cuales son paquetes relacionados con cosas. Estos paquetes pueden incluir componentes, servicios, directivas, flujos y otros M&#xF3;dulos Angular. Nosotros ya tenemos un m&#xF3;dulo raiz definido en el archivo <code>app/app.module.ts</code>. Vamos a ver este archivo.</p>
<p>La &#xFA;ltima l&#xED;na en este arcihivo define una clase Javascript:</p>
<pre><code class="lang-js"><span class="hljs-keyword">export</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">AppModule</span> </span>{ }
</code></pre>
<p><code>export</code> es una palabra reservada en Javascript que dice que lo que sea que est&#xE9; definido despu&#xE9;s debe ser expuesto a otros archivos que lo importen usando la sentencia <code>import</code>. Puedes ver ejemplos de estas clases importadas desde otros archivos en las primeras lineas de este archivo.</p>
<p>La clase <code>AppModule</code> est&#xE1; vac&#xED;a. Esta obtendr&#xE1; su funcionalidad de Angular, el cual identificar&#xE1; su rol con el c&#xF3;digo precedente a esta l&#xFA;na, comenzando con <code>@ngModule({})</code>.</p>
<p>Cada entidad en Angular (ngModule, componentes, servicios, directivas y flujos) son solamente <strong>clases con un decorador</strong>. El decorador le dice a Angular cual es el rol de esta clase.</p>
<p><code>@ngModule({...})</code> es un decorador. Un decorador es solo una funci&#xF3;n. Cuando lo usamos colocamos <code>@</code> antes de su nombre. De esta manera se convierte en un decorador: el toma lo que est&#xE1; escrito justo despu&#xE9;s de esta funci&#xF3;n y lo recibe como argumento. Los decoradores usualmente hacen algo con lo que vana decorar, por ejemplo, <code>ngModule</code> recive la clase <code>AppModule</code> y le agrega m&#xE9;todos y miembros que mas tarde son usados por Angular. De esta manera, Angular reconocer&#xE1; que esta clase representa un ngModule.</p>
<p>Lo que pasa con la funcion decorador es usado por Angular para decorar la clase. Tu puedes ver que nosotros pasamos un objeto con miebros, cada miembro es una lista de otras clases. Explicaremos cortamente lo que cada miembro representa.</p>
<p><strong>declaraciones</strong>: Una lista de elementos de Angular que son relevantes en este m&#xF3;dulo. Ellos har&#xE1;n uso entre ellos (por ejemplo, una directiva usada en un componente). Nosotros pasamo aqu&#xED; &#xFA;nicamente el componente - <code>AppComponent</code>, porque es todo lo que nuestra aplicaci&#xF3;n tiene actualmente.</p>
<p><strong>importaciones</strong>: Una lista de ngModules los cuales son necesitados por este m&#xF3;dulo. Por ejemplo, podemos usar elementos de <code>FormsModule</code> - directivas y servicios, dentro de <code>AppComponent</code>.</p>
<p><strong>proveedores</strong>: Una lista de servicios los cuales son proveidos por la raiz de la aplicaci&#xF3;n. Un servicio es tambi&#xE9;n una clase, y al proveer una sola instancia (singleton) es creado para toda la aplicaci&#xF3;n. Nosotros hablaremos sobre servicios mas tarde.</p>
<p><strong>bootstrap</strong>: Este miembro es relevante &#xFA;nicamente a al m&#xF3;dulo raiz. Tu no lo encontrar&#xE1;s en los m&#xF3;dulos o en la lista de importaciones por ejemplo. Esto le dice a Angular que componente va a ser usado como componente raiz que comenzar&#xE1; la estructura completa. As&#xED; que actualmente tenemos un <strong>estructura de &#xE1;rbol</strong> d elos componentes que contruyen nuestra aplicaci&#xF3;n. En este caso, el componente raiz es <code>AppComponent</code> (con el selector <code>todo-root</code>). Nosotros vimos que es usado en <code>index.html</code> como el &#xFA;nico componente dentro del <code>&lt;body&gt;</code>.</p>
<p>C&#xF3;mo angular sabe que <code>AppModule</code> es el m&#xF3;dulo raiz?  Esto est&#xE1; definido en el archivo <code>main.ts</code> en la &#xFA;ltima l&#xED;nea:</p>
<pre><code class="lang-js">platformBrowserDynamic().bootstrapModule(AppModule);
</code></pre>
<p>Nosotros le pasamos nuestro m&#xF3;dulo raiz al rederizador. Esta es la manera de decirle a Angular cual es el m&#xF3;dulo inicial para comenzar nuestra aplicaci&#xF3;n. Y tambi&#xE9;n escogemos un rederizador: <code>platformBrowserDynamic</code>. Este sabe como tomar nuestro c&#xF3;digo y agregar la informaci&#xF3;n relevante (elementos, atributos, etc) al DOM del navegador.</p>
<p>Tambi&#xE9;n podemos usar diferentes renderizadores en este punto, por ejemplo uno que renderiza a elementos nativos de Android o OS! Nosotros solo necesitamos renderizador que sepa como tomar los templates (que usan notaci&#xF3;n HTML) y c&#xF3;digo Javascript, y crear elementos de una aplicaci&#xF3;n nativa mo&#xF3;vil. Un ejemplo de estos rederizadores es NativeScript por Telerik.</p>
<p>Tambi&#xE9;n hay renderizadores para Arduino, con los que te puedes conectar con sensores, botones, LEDs y otro hardware a tu aplicaci&#xF3;n. Puedes ver un gran ejemplo aqu&#xED; [Construyendo Simon con Angular2-IOT].(<a href="https://medium.com/@urish/building-simon-with-angular2-iot-fceb78bb18e5#.430qu216w" target="_blank">https://medium.com/@urish/building-simon-with-angular2-iot-fceb78bb18e5#.430qu216w</a>)</p>
<p>Nosotros hemos visto como decirle a Angular como comenzar a trabajr. como definir el m&#xF3;dulo raiz y los componentes ra&#xED;zm y como usar el componente raiz.</p>
<p>En el siguiente cap&#xED;tulo vamos a ver como un componente es definido en Angular.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="installations.html" class="navigation navigation-prev " aria-label="Previous page: Instalaciones">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="component.html" class="navigation navigation-next " aria-label="Next page: Componentes">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Angular kicks in","level":"1.4","depth":1,"next":{"title":"Componentes","level":"1.5","depth":1,"path":"component.md","ref":"component.md","articles":[]},"previous":{"title":"Instalaciones","level":"1.3","depth":1,"path":"installations.md","ref":"installations.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"angular_kicks_in.md","mtime":"2018-01-07T13:44:53.265Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-01-08T02:47:59.063Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

