
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Componentes · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="a_new_component.html" />
    
    
    <link rel="prev" href="angular_kicks_in.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Acerca de
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    Introdicción
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="installations.html">
            
                <a href="installations.html">
            
                    
                    Instalaciones
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="angular_kicks_in.html">
            
                <a href="angular_kicks_in.html">
            
                    
                    Angular kicks in
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="component.html">
            
                <a href="component.html">
            
                    
                    Componentes
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="a_new_component.html">
            
                <a href="a_new_component.html">
            
                    
                    Un nuevo componente
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="class.html">
            
                <a href="class.html">
            
                    
                    Clases
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="property_binding.html">
            
                <a href="property_binding.html">
            
                    
                    Enlace de Propiedades
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="event_binding.html">
            
                <a href="event_binding.html">
            
                    
                    Enlace de Eventos
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="element_ref_-.html">
            
                <a href="element_ref_-.html">
            
                    
                    Elemento ref - #
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="the_list.html">
            
                <a href="the_list.html">
            
                    
                    La lista
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="new_component_todo-item.html">
            
                <a href="new_component_todo-item.html">
            
                    
                    Nuevo componente todo-item
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="add_items.html">
            
                <a href="add_items.html">
            
                    
                    Agregar elementos
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="refactor_app_component.html">
            
                <a href="refactor_app_component.html">
            
                    
                    Reconstruir app component
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="adding_style.html">
            
                <a href="adding_style.html">
            
                    
                    Agregar estilos
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="service.html">
            
                <a href="service.html">
            
                    
                    Servicios
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="add_more_abilities_to_service.html">
            
                <a href="add_more_abilities_to_service.html">
            
                    
                    Agrega mas características al servicio
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="local_storage.html">
            
                <a href="local_storage.html">
            
                    
                    Local storage
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="remove_item.html">
            
                <a href="remove_item.html">
            
                    
                    Eliminar elemento
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="adding_a_checkbox.html">
            
                <a href="adding_a_checkbox.html">
            
                    
                    Agregar un checkbox
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="deploy_to_githubpages.html">
            
                <a href="deploy_to_githubpages.html">
            
                    
                    Desplegar a GithubPages
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="enrich_the_todo-item_component.html">
            
                <a href="enrich_the_todo-item_component.html">
            
                    
                    Enriquecer el componente todo-item
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="generating_a_new_project.html">
            
                <a href="generating_a_new_project.html">
            
                    
                    Apéndice 1: Generando un nuevo proyecto
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="appendix-2-tutorial-extensions.html">
            
                <a href="appendix-2-tutorial-extensions.html">
            
                    
                    Apéndice 2: Extensiones del tutoral
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Componentes</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="componentes">Componentes</h1>
<p>Una aproximaci&#xF3;n en desarrollo web (y desarrollo de software generalmente) es la arquitectura basada en componentes. En los a&#xF1;os pasados gan&#xF3; mucha popularidad. &#xBF;Qu&#xE9; es un componente?</p>
<p>Helmut Petritsch lo define es <a href="http://petritsch.co.at/download/SOA_vs_component_based.pdf" target="_blank">Arquitectura basada en servicios vs Arquitectura basada en Componentes</a>:</p>
<blockquote>
<p>Un componente es un objeto de software, definido para interactuar con otros componentes, encapsulando cierta funcionalidad o conjunto de funcionalidades. Un componente tiene una interfaz claramente definida y conforma un componertamiento preescrito com&#xFA;n a todos los componentes en la arquitectura.</p>
</blockquote>
<p>En aplicaciones web, <strong>un componente controla un segmento de pantalla llamado vista</strong>. Es una parte de lo que eventualmente veremos en la pantalla. Tiene su plantilla, la cual define la estructura visual. Tambi&#xE9;n tiene l&#xF3;gica que define el comportamiento y los valores din&#xE1;micos. La parte l&#xF3;gica es c&#xF3;digo Javascript y es llamado el controlador.</p>
<p>Aqu&#xED; hay un diagrama de un componente en Angular, con el resultado abajo.
<img src="Angular Component.001.jpeg" alt="Angular 2 Component"></p>
<p>Las directivas, flujos y servicios son otros bloques de construcci&#xF3;n en Angular, lo cual discutiremos mas tarde en el tutorial.</p>
<p>Miremos el componente que fue creado por Angular CLI. Todos los archivos relevantes existen en la carpeta <code>src/app</code>. Abre el archivo <code>app.component.ts</code>.</p>
<p>Al igual que los m&#xF3;dulos que vimos en el cap&#xED;tulo previo, un componente tambi&#xE9;n est&#xE1; definido por un decorador de clase. Este es la definici&#xF3;n de clase:</p>
<pre><code class="lang-js"><span class="hljs-keyword">export</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">AppComponent</span> </span>{
  title = <span class="hljs-string">&apos;todo works!&apos;</span>;
}
</code></pre>
<p>Tiene un miembro llamado &quot;title&quot;. Es una variable a la que le puedes asignar un valor. El valor asignado aqu&#xED; es la cadena &quot;todo works!&quot;.</p>
<p>Angular se encarga de sincronizar los miembros del componente con los componentes de la plantilla, as&#xED; que podemos f&#xE1;cilmente usar el miembro <code>title</code> en la plantilla. Mira la plantilla adjuntada al componente en el:</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">h1</span>&gt;</span>
  {{ title }}
<span class="hljs-tag">&lt;/<span class="hljs-name">h1</span>&gt;</span>
</code></pre>
<p>Las llaves dobles y su contenido son llamadas <strong>Interpolaci&#xF3;n</strong>. Esta es una forma de <strong>data binding</strong> en Angular. Como mencionamos anteriormente, el c&#xF3;digo en este archivo no es usado cuando el cnavegador renderiza el componente. Angular compila a c&#xF3;digo Javascript. En una paso de la compilaci&#xF3;n, se buscan las interpolaciones dentro de la plantilla. <strong>El contenido de la Interpolaci&#xF3;n es una expresi&#xF3;n escrita en Javascript</strong>. En tiempo de ejecuci&#xF3;n, la expresi&#xF3;n es evaluadam y puedes ver el resultado.</p>
<p>Interpolaci&#xF3;n es una las caracter&#xED;sticas mas poderosas y b&#xE1;sicas en Angular. Existe desde el comienzo de Angular -  en la primera versi&#xF3;n. Hace uso insertar datos din&#xE1;micos a la vista.</p>
<p>En este componente, la expresi&#xF3;n es simplemente el miembro de la casle componente <code>title</code>. <strong>Vamos a cambiarlo</strong>. Trata de seguir y ver el resultado en el navegador. (&#xA1;Con cada cambio que hagas en el archivo, el navegador se refrescar&#xE1; autom&#xE1;ticamente!).</p>
<ul>
<li>Elimina el contenido de las llaves y manten solo el contenido de <code>title</code></li>
<li>Coloca de nuevo las llaves y reemplaza el contenido con alguna expresi&#xF3;n matem&#xE1;tica, por ejemplo: <code>{{ 2 + 2 }}</code>. (Estos espacios no son obligatorios, solo hacen el c&#xF3;digo mas legible).</li>
<li>Escribe una expresi&#xF3;n matem&#xE1;tica combinada con el miembro <code>title</code>: <code>{{ title + 10 }}</code> </li>
<li>Pasa una variable no definida a la expresi&#xF3;n - una variable la cual no ha sido declarada en la clase componente. Por ejemplo: `{{ x }}&#xA1; </li>
<li>Intenta lo que quieras. No te preocupes, &#xA1;no puedes hacerle ning&#xFA;n da&#xF1;o al navegador o al computador! En el peor de los casso, el navegador se quedar&#xE1; sin memoria y se atascar&#xE1; (&#xA1;Pero tendr&#xE1;s que escribir algo realmente complicado para hacer que es pase!).</li>
</ul>
<p>Esta es una manera en la que puedes enlazar miembros del componente a su plantilla. &#xBF;C&#xF3;mo Angular sabe cual es la plantilla del componente App?</p>
<p>Vamos atr&#xE1;s al archivo <code>app.component.ts</code> y mira la metadata definida en el decorador <code>@Component</code> justo debajo de la definici&#xF3;n de clase:</p>
<pre><code class="lang-js">@Component({
  selector: <span class="hljs-string">&apos;todo-root&apos;</span>,
  templateUrl: <span class="hljs-string">&apos;./app.component.html&apos;</span>,
  styleUrls: [<span class="hljs-string">&apos;./app.component.css&apos;</span>]
})
</code></pre>
<p>Le pasamos un objeto de definiciones al decorador, como vimos en el cap&#xED;tulo anterior con ngModule. La segunda propiedad, <code>templateUrl</code> le dice a Angular donde buscar por la plantilla adjunta al componente. Aqu&#xED; hay otra opci&#xF3;n para apuntar a la plantilla, la cual es una mejor pr&#xE1;ctica: escribir toda la plantilla en el mismo archivo aqu&#xED;, en la definici&#xF3;n de componente. Discutiremos esto despu&#xE9;s.</p>
<p>La tercera propiedad, <code>styleUrls</code> le dice a Angular donde buscar por archivos CSS que definen el estilo del componente. Este puede tener m&#xFA;ltiples archivos CSS. Esta es la raz&#xF3;n por la que <code>styleUrls</code> es un arreglo. Puedes ver al archivo <code>app.component.css</code>, ver&#xE1;s que est&#xE1; vac&#xED;o. Puede agregar alg&#xFA;n estilo CSS aqu&#xED;, por ejemplo:</p>
<pre><code class="lang-css"><span class="hljs-selector-tag">h1</span> {
  <span class="hljs-attribute">color</span>: red;
}
</code></pre>
<p>A&#xF1;adiremos mas estilos luego.</p>
<p>La primera propiedad, <code>selector</code> le dice a Angular cual va a ser el nombre de la etiqueta que usaremos para llamar al componente. Como vemos en el archivo <code>src/index.html</code>, usaremos el compoente todo-root dentro del cuerpo:</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">body</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">todo-root</span>&gt;</span>Loading...<span class="hljs-tag">&lt;/<span class="hljs-name">todo-root</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">body</span>&gt;</span>
</code></pre>
<p>El elemento <code>todo-root</code> no es un elemento HTML. Es un componente que creamos con el selector <code>todo-root</code>. Trata de cambiar el selector. Ver&#xE1;s que si tu cambias solamente  uno de los archivos, &quot;Loading...&quot; aparecer&#xE1;. Este es el contenido que colocamos dentro del elemento <code>index.html</code>, y es renderizado mientras no lo reemplacemos con el componente de Angular. Puedes ver en la consola del navegador un c&#xF3;digo de error.</p>
<p>Una &#xFA;ltima cosa, la primera l&#xED;nea del componente importa el ceodigo que define el decorador <code>@Component</code>. Esto es necesario para usar el decorador, el cual es definido en el archivo importado (o actualmente, en uno de sus propias importaciones). Trata de eliminar esta l&#xED;nea y ver&#xE1;s el error.</p>
<h4 id="plantillas-en-l&#xED;nea">Plantillas en l&#xED;nea</h4>
<p>Vamos a mover la plantilla para que est&#xE9; en l&#xED;nea con la definici&#xF3;n del componente. Esto nos puede ayudar a manejar la plantilla viendo su propia funcionalidad.</p>
<p>En el archivo <code>app.component.ts</code> reemplaza la l&#xED;nea</p>
<pre><code class="lang-js">templateUrl: <span class="hljs-string">&apos;./app.component.html&apos;</span>,
</code></pre>
<p>con</p>
<pre><code class="lang-js">template: <span class="hljs-string">``</span>,
</code></pre>
<p>Nota las <strong>comillas inclinadas</strong> - Ellas son usadas para definir Plantillas Literales, con son nuevas en JAvascript (ES6). De esta manera puedes definir cadenas de m&#xFA;ltiples l&#xED;neas. Estas pueden tener otra habilidad: Facilmente usar variables de Javascript y expresiones en a cadena (sin relaciones a expresiones enlazadas  de Angular en la plantilla). Lee mas sobre esto en la <a href="https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Template_literals" target="_blank">documentaci&#xF3;n MDN</a>.</p>
<p>Aseg&#xFA;rate de reemplazar <code>templateURL</code> con <code>template</code> y no olvides la coma al final de la l&#xED;nea.</p>
<p>Ahora copia la plantilla completa desde <code>app.component.html</code> y p&#xE9;gala entre las comillas inclinadas. Ver&#xE1;s que re formatear el c&#xF3;digo es muy f&#xE1;cil con la visi&#xF3;n:</p>
<pre><code class="lang-js">template: <span class="hljs-string">`
  &lt;h1&gt;
    {{ title }}
  &lt;/h1&gt;  
`</span>,
</code></pre>
<p>Es f&#xE1;cil manejar la plantilla cuando puedes ver el controlador al mismo tiempo. Esto es verdad mientras la plantilla no se agrande y el contorlador se vuelva complicado. Si esto es as&#xED;, deber&#xED;as reconstruir tu c&#xF3;digo partiendo el componente en varios mas peque&#xF1;os.</p>
<p>En este punto puedes eliminar el archivo <code>app.component.html</code>.</p>
<blockquote>
<p>Cuando generamos un nuevo proyecto podemos definir que te gustar&#xED;a usar una plantilla en l&#xED;na para el componente principal con la bandera <code>-it</code> (o <code>--inline-template</code>). &#xA1;Ten esto en mente para tu pr&#xF3;ximo proyecto!</p>
</blockquote>
<p>De la misma manera en que usamos la plantilla en l&#xED;nea podemos usar los estilos en l&#xED;nea. Pero por ahora est&#xE1; bien mantener los estilos en un archivo separado.</p>
<h3 id="resumen">Resumen</h3>
<p>Hemos explorado el componente raiz que fue generado por Angular CLI, e incluso lo hemos reconstruido. En el siguiente cap&#xED;tulo crearemos un nuevo componente. Comenzaremos a comenzar a construir &#xE1;rboles de componentes, los cuales definen la estructura de la aplicaci&#xF3;n.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="angular_kicks_in.html" class="navigation navigation-prev " aria-label="Previous page: Angular kicks in">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="a_new_component.html" class="navigation navigation-next " aria-label="Next page: Un nuevo componente">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Componentes","level":"1.5","depth":1,"next":{"title":"Un nuevo componente","level":"1.6","depth":1,"path":"a_new_component.md","ref":"a_new_component.md","articles":[]},"previous":{"title":"Angular kicks in","level":"1.4","depth":1,"path":"angular_kicks_in.md","ref":"angular_kicks_in.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"component.md","mtime":"2017-12-21T15:06:43.852Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-01-07T13:38:07.125Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

